app/views/pages/profile.html.erb

SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "its007Kevin"], ["LIMIT", 1]]
---
			<h3 style="font-weight: bold"><%= @username %></h3>
			<%= render '/components/follow_button', :user => User.find_by_username(params[:id]) %>