app/controllers/posts_controller.rb

INSERT INTO "posts" ("content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["content", "Kevin's new post"], ["user_id", 2], ["created_at", "2018-01-07 16:05:45.942576"], ["updated_at", "2018-01-07 16:05:45.942576"]]
---
	def create
		@post = Post.new(post_params)
		@post.user_id = current_user.id
		@post.save