app/controllers/rankings_controller.rb

  def create
    @ranking = Ranking.new(ranking_params_create)
    @ranking.save
---
INSERT INTO "rankings" ("employerRank", "yourRank", "user_id", "job_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["employerRank", 0], ["yourRank", 1], ["user_id", 1], ["job_id", 1], ["created_at", "2018-01-23 23:37:52.886457"], ["updated_at", "2018-01-23 23:37:52.886457"]]

  def update
    @ranking = Ranking.find(params[:id])
    @ranking.update(ranking_params_update)
---
SELECT  "rankings".* FROM "rankings" WHERE "rankings"."id" = $1 LIMIT $2  [["id", 15], ["LIMIT", 1]]
UPDATE "rankings" SET "employerRank" = $1, "updated_at" = $2 WHERE "rankings"."id" = $3  [["employerRank", "Offer"], ["updated_at", "2018-01-28 04:24:51.102841"], ["id", 16]]

  def destroy
    @ranking = Ranking.find(params[:id])
    @ranking.destroy
---
SELECT  "rankings".* FROM "rankings" WHERE "rankings"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
DELETE FROM "rankings" WHERE "rankings"."id" = $1  [["id", 5]]